In [1]:
import pandas as pd
import numpy as np

In [29]:
df1 = pd.read_excel('MT_JT.xlsx')
df2 = pd.read_excel('MT_OT.xlsx')
df3 = pd.read_excel('ManpowerTalent_EMEA.xlsx')

In [30]:
df1.head()

   Unnamed: 0                                                  0
0           0                         Assoc Recruiter Consultant
1           1                         Assoc Recruiter Consultant
2           2                                Associate Recruiter
3           3              Benefits/LOA Program Manager - Remote
4           4  Bilingual Talent Acquisition Coordinator (Fren...

In [31]:
df2.head(10)

   Unnamed: 0                                    0
0           0  MILWAUKEE, WISCONSIN, UNITED STATES
1           1                            CATEGORY:
2           2                      Human Resources
3           3                       POSITION TYPE:
4           4                            Full-time
5           5                              POSTED:
6           6                           09-09-2022
7           7  MILWAUKEE, WISCONSIN, UNITED STATES
8           8                            CATEGORY:
9           9                      Human Resources

In [32]:
len(df2)

378

In [33]:
378/7

54.0

In [34]:
# create a logic to split required values in respedcted columns


# create empty lists to store data
countries = []
date = []


# start the loop for separating location values
for val in range(len(df2)):
    
    if (val == 0) or (val%7 == 0):
        countries.append(df2[0][val])

In [35]:
df1['Location'] = countries

In [36]:
df1 = df1.rename(columns={0:"Job_Title"})

In [38]:
df1.head()

,Unnamed: 0,Job_Title,Location
0,0,Assoc Recruiter Consultant,"MILWAUKEE, WISCONSIN, UNITED STATES"
1,1,Assoc Recruiter Consultant,"MILWAUKEE, WISCONSIN, UNITED STATES"
2,2,Associate Recruiter,"MILWAUKEE, WISCONSIN, UNITED STATES"
3,3,Benefits/LOA Program Manager - Remote,"MILWAUKEE, WISCONSIN, UNITED STATES"
4,4,Bilingual Talent Acquisition Coordinator (Fren...,CANADA

In [39]:
df3.head()

   Unnamed: 0                            Job_Title        Location
0           0        Talent Acquisition Specialist          POLAND
1           1           Senior Solutions Architect  UNITED KINGDOM
2           2  Senior Manager RPO Program Delivery          POLAND
3           3  Recruitment Team Leader with French          POLAND
4           4              Recruitment Team Leader          POLAND

In [40]:
data = pd.concat([df1,df3])

In [41]:
data

,Unnamed: 0,Job_Title,Location
0,0,Assoc Recruiter Consultant,"MILWAUKEE, WISCONSIN, UNITED STATES"
1,1,Assoc Recruiter Consultant,"MILWAUKEE, WISCONSIN, UNITED STATES"
2,2,Associate Recruiter,"MILWAUKEE, WISCONSIN, UNITED STATES"
3,3,Benefits/LOA Program Manager - Remote,"MILWAUKEE, WISCONSIN, UNITED STATES"
4,4,Bilingual Talent Acquisition Coordinator (Fren...,CANADA
...,...,...,...
3,3,Recruitment Team Leader with French,POLAND
4,4,Recruitment Team Leader,POLAND
5,5,Global Market Intelligence Manager,POLAND
6,6,Global IT Senior Test Specialist,POLAND
7,7,Cyber-Security Solutions Architect,POLAND

In [42]:
data.to_excel('ManpowerTalent.xlsx')